research/eco_features/hardware_design.org
#+OPTIONS: ^:nil
* Notes on hardware design for Eco Features
** Testing harness
   I need a way to make sure that my design is working
*** DONE Explore Agile SoC
    SCHEDULED: <2017-07-06 Thu 8:30-10:00>

*** DONE Hello world with TDD for verilog [3/3]
    SCHEDULED: <2017-07-07 Fri 11:00-14:00>
    - [X] Get simulator
      - Can I get one of these:
	- Mentor Graphics Questa
	- Cadence Incisive
	- Synopsys VCS
	- Aldec Riviera PRO
      - I ended up using Vivado simulator
	- You need to use three commands
	  - xvlog files.sv (or xvhdl for vhdl)
	  - xelab module_name -s my_snapshot
	  - xsim my_snapshot
    - [X] Set up simple sv unit test on desktop
    - [X] Make test more meaningful
** Eco prediction block
*** Overview
#+TBLNAME:I/O Spec
   | Type | Name              | Description                        |
   |------+-------------------+------------------------------------|
   | in   | clk               | System clock                       |
   | in   | rst               | reset                              |
   | in   | px_data           | incoming pixel value               |
   | in   | px_valid          | valid strobe, synchronous with clk |
   | in   | frame_start       | idicates first pixel of frame      |
   | out  | prediction        | the classification value           |
   | out  | prediction_valid  | prediction valid signal            |
   This block will be loaded with training data. A driver will stream pixel values from an image and the block will make a correct prediction.
*** Eco feature block
**** Overview
     - Produce every possible creature
     - Receives pixels in sequential order
*** Random Forest
**** Tree Design
     Because the hardware will be fixed, I will build the trees with the maximum number of nodes.
     There will be no leaves that terminate a branch before the maximum depth.
***** BRAM storage
      I could either store the nodes in some standard order based on their position in the tree, or I could store them in the order that they will be produced by the eco feature which is sorted by variable number
***** Resources Needed
      #+TBLNAME:Estimated Bits for Node
      | Data  | Range     | Bits |
      |-------+-----------+------|
      | Var   | 0 - 10,00 |   14 |
      | Value | 22 +/-    |   21 |
      | Id    | 0 - 30    |    6 |
      |-------+-----------+------|
      | Total |           |   41 |
      #+TBLFM: $3=vsum(@2..@-1)

      My Kintex has 445 BRAMs with 36Kb each. I could probably just have every tree fit into a BRAM.
      
