research/eco_features/hardware_design.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Notes on hardware design for Eco Features</a>
<ul>
<li><a href="#sec-1-1">1.1. Testing harness</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. <span class="done DONE">DONE</span> Explore Agile SoC</a></li>
<li><a href="#sec-1-1-2">1.1.2. <span class="done DONE">DONE</span> Hello world with TDD for verilog <code>[3/3]</code></a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Eco prediction block</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Overview</a></li>
<li><a href="#sec-1-2-2">1.2.2. Eco feature block</a></li>
<li><a href="#sec-1-2-3">1.2.3. Random Forest</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Notes on hardware design for Eco Features</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Testing harness</h3>
<div class="outline-text-3" id="text-1-1">
<p>
I need a way to make sure that my design is working
</p>
</div>
<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> <span class="done DONE">DONE</span> Explore Agile SoC</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> <span class="done DONE">DONE</span> Hello world with TDD for verilog <code>[3/3]</code></h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li><code>[X]</code> Get simulator
<ul class="org-ul">
<li>Can I get one of these:
<ul class="org-ul">
<li>Mentor Graphics Questa
</li>
<li>Cadence Incisive
</li>
<li>Synopsys VCS
</li>
<li>Aldec Riviera PRO
</li>
</ul>
</li>
<li>I ended up using Vivado simulator
<ul class="org-ul">
<li>You need to use three commands
<ul class="org-ul">
<li>xvlog files.sv (or xvhdl for vhdl)
</li>
<li>xelab module_name -s my_snapshot
</li>
<li>xsim my_snapshot
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><code>[X]</code> Set up simple sv unit test on desktop
</li>
<li><code>[X]</code> Make test more meaningful
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Eco prediction block</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Overview</h4>
<div class="outline-text-4" id="text-1-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Name</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">in</td>
<td class="left">clk</td>
<td class="left">System clock</td>
</tr>

<tr>
<td class="left">in</td>
<td class="left">rst</td>
<td class="left">reset</td>
</tr>

<tr>
<td class="left">in</td>
<td class="left">px_data</td>
<td class="left">incoming pixel value</td>
</tr>

<tr>
<td class="left">in</td>
<td class="left">px_valid</td>
<td class="left">valid strobe, synchronous with clk</td>
</tr>

<tr>
<td class="left">in</td>
<td class="left">frame_start</td>
<td class="left">idicates first pixel of frame</td>
</tr>

<tr>
<td class="left">out</td>
<td class="left">prediction</td>
<td class="left">the classification value</td>
</tr>

<tr>
<td class="left">out</td>
<td class="left">prediction_valid</td>
<td class="left">prediction valid signal</td>
</tr>
</tbody>
</table>
<p>
This block will be loaded with training data. A driver will stream pixel values from an image and the block will make a correct prediction.
</p>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Eco feature block</h4>
<div class="outline-text-4" id="text-1-2-2">
</div><ol class="org-ol"><li><a id="sec-1-2-2-1" name="sec-1-2-2-1"></a>Overview<br  /><div class="outline-text-5" id="text-1-2-2-1">
<ul class="org-ul">
<li>Produce every possible creature
</li>
<li>Receives pixels in sequential order
</li>
</ul>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Random Forest</h4>
<div class="outline-text-4" id="text-1-2-3">
</div><ol class="org-ol"><li><a id="sec-1-2-3-1" name="sec-1-2-3-1"></a>Tree Design<br  /><div class="outline-text-5" id="text-1-2-3-1">
<p>
Because the hardware will be fixed, I will build the trees with the maximum number of nodes.
There will be no leaves that terminate a branch before the maximum depth.
</p>
</div>
<ol class="org-ol"><li><a id="sec-1-2-3-1-1" name="sec-1-2-3-1-1"></a>BRAM storage<br  /><div class="outline-text-6" id="text-1-2-3-1-1">
<p>
I could either store the nodes in some standard order based on their position in the tree, or I could store them in the order that they will be produced by the eco feature which is sorted by variable number
</p>
</div>
</li>
<li><a id="sec-1-2-3-1-2" name="sec-1-2-3-1-2"></a>Resources Needed<br  /><div class="outline-text-6" id="text-1-2-3-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Data</th>
<th scope="col" class="left">Range</th>
<th scope="col" class="right">Bits</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Var</td>
<td class="left">0 - 10,00</td>
<td class="right">14</td>
</tr>

<tr>
<td class="left">Value</td>
<td class="left">22 +/-</td>
<td class="right">21</td>
</tr>

<tr>
<td class="left">Id</td>
<td class="left">0 - 30</td>
<td class="right">6</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Total</td>
<td class="left">&#xa0;</td>
<td class="right">41</td>
</tr>
</tbody>
</table>

<p>
My Kintex has 445 BRAMs with 36Kb each. I could probably just have every tree fit into a BRAM.
</p>
</div>
</li></ol>
</li></ol>
</div>
</div>
</div>
